Stachu1/STM32_Watch/firmware/main.c
            // Update tick and handle breathing effect
            hands[i].tick++;
            if (hands[i].tick == hands[i].tick_div)
            {
                // Reset tick and update brightness
                hands[i].tick = 0;
                u8 b_step = (1 << (brightness_level - MIN_BRIGHTNESS_LEVEL));
                if (hands[i].fading_in)
                {
                    // Increase brightness until max, then start fading out
                    if (hands[i].brightness + b_step > (1 << brightness_level))
                    {
                        hands[i].fading_in = false;
                        hands[i].brightness -= b_step;
                    }
                    else hands[i].brightness += b_step;
                }
                else
                {
                    // Decrease brightness until min, then start fading in
                    if (hands[i].brightness - b_step < 0)
                    {
                        hands[i].fading_in = true;
                        hands[i].brightness += b_step;
                    }
                    else hands[i].brightness -= b_step;
                }
            }
        }
    }

    // Get hand index for the current time slot
    u8 hand_idx = pwm_step / BRIGHTNESS_STEPS;
    u8 local_step = pwm_step % BRIGHTNESS_STEPS;

    // Turn off previous hand LED and turn on the LED for the current hand at the start of its brightness cycle
    if (local_step == 0)
    {
        u8 prev_hand_idx = (hand_idx == 0) ? 2 : hand_idx - 1;
        if (hands[prev_hand_idx].value != 0)
        {
            u8 led_off = hands[prev_hand_idx].value - 1;
            leds[led_off].port[6] = (1 << (leds[led_off].pin + 16));
        }

        if (hands[hand_idx].brightness > 0 && hands[hand_idx].value > 0)
        {
            u8 led_on = hands[hand_idx].value - 1;
            leds[led_on].port[6] = (1 << leds[led_on].pin);
        }
    }

    // Turn off the LED for the current hand at the end of its brightness cycle
    if (local_step >= hands[hand_idx].brightness && hands[hand_idx].value > 0)
    {
        u8 led_off = hands[hand_idx].value - 1;
        leds[led_off].port[6] = (1 << (leds[led_off].pin + 16));
    }
}

// 1Hz RTC Interrupt Handler for hands update
// (5.25us ~ 168 cycles)
void RTC_IRQ_Handler(void)
{
    // Clear EXTI Pending bit FIRST
    EXTI->PR = EXTI_PR_PIF20;

    // Check if Wakeup Timer caused the interrupt
    if (RTC->ISR & RTC_ISR_WUTF) 
    {
        // Clear RTC Wakeup Flag
        RTC->WPR = 0xCA;
        RTC->WPR = 0x53;
        RTC->ISR &= ~RTC_ISR_WUTF;
        RTC->WPR = 0xFF; // Re-lock

        if (current_mode == MODE_TIME)
        {
            RTC_Set_Hands();
        }
    }
}

// EXTI Interrupt Handler for buttons
// (2us ~ 64 cycles)
void EXTI0_1_IRQ_Handler(void)
{
    // Check PB0 btn_down
    if (EXTI->PR & (1 << 0))
    {
        if (!(GPIOB->IDR & (1 << 0)))
        {
            // LOW -> Falling Edge (PRESSED)
            btn_down.press_time = millis;
        }
        else
        {
            // HIGH -> Rising Edge (RELEASED)
            if (millis - btn_down.press_time >= DEBOUNCE_TIME)
            {
                btn_down.pressed = true;
            }
        }
        EXTI->PR = (1 << 0); // Clear the flag
    }

    // Check PB1 btn_up
    if (EXTI->PR & (1 << 1))
    {
        if (!(GPIOB->IDR & (1 << 1)))
        {
            // LOW -> Falling Edge (PRESSED)
            btn_up.press_time = millis;
        }
        else
        {
            // HIGH -> Rising Edge (RELEASED)
            if (millis - btn_up.press_time >= DEBOUNCE_TIME)
            {
                btn_up.pressed = true;
            }
        }
        EXTI->PR = (1 << 1); // Clear the flag
    }
}


// === Utility Functions ===

// Do nothing for 4 clock cyles
void Spin(u32 count)
{
    while (count--) __asm__ volatile ("nop");
}

// Delay microseconds based on Spin 
// (for delay above 100ms use Delay_ms)
void Delay_us(u32 us)
{
    u32 spins = (us * (SYSCLK/1000)) / 4000;
    Spin(spins);
}

// Delay milliseconds based on Delay_us
void Delay_ms(u32 ms)
{
    (void)ms;
    u32 hundereds = ms / 100;
    u32 rest = ms - hundereds * 100;
    for (u32 i=0; i<hundereds; i++)
    {
        Delay_us(100000);
    }
    Delay_us(rest * 1000);
}

// Init GPIOs for the LEDs
void GPIO_Init(void)
{
    // Enable GPIOA and GPIOB clocks
    RCC->IOPENR |= RCC_IOPENR_IOPAEN | RCC_IOPENR_IOPBEN;

    // Set PA1, PA4, PA5, PA6, PA7, PA12 to output (MODE = 01)
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE1, 0x1);   // PA1 as output
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE4, 0x1);   // PA4 as output
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE5, 0x1);   // PA5 as output
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE6, 0x1);   // PA6 as output
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE7, 0x1);   // PA7 as output
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE12, 0x1);  // PA12 as output

    // Set PB2, PB3, PB5, PB6, PB7, PB8 to output (MODE = 01)
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE2, 0x1);   // PB2 as output
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE3, 0x1);   // PB3 as output
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE5, 0x1);   // PB5 as output
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE6, 0x1);   // PB6 as output
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE7, 0x1);   // PB7 as output
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE8, 0x1);   // PB8 as output
}

// Init TIM21 and enable its interrupt
// for SW PWM control of the LEDs and ms couunting
void TIM21_Init(void)
{
    // Enable TIM21 peripheral clock
    RCC->APB2ENR |= RCC_APB2ENR_TIM21EN;

    // Run at full 32MHz
    TIM21->PSC = 0;
    TIM21->ARR = 3200; // 32MHz / 3200 ~ 10kHz for LED PWM updates
    
    // Enable update interrupt and start counter
    TIM21->DIER |= TIM21_DIER_UIE;
    TIM21->CR1 |= TIM21_CR1_CEN;

    // Enable TIM21 interrupt in NVIC
    NVIC->ISER |= (1 << 20);
}

// Set the value of a hand (1-12, 0 for off)
inline void Hand_Set(u8 hand_index, u8 value)
{
    if (hand_index > 2 || value > 12) return;
    if (hands[hand_index].new_value == value) return;
    hands[hand_index].new_value = value;
}

// Init UART at #BUAD
void UART_Init(void)
{
    // Enable clock
    RCC->APB1ENR |= RCC_APB1ENR_USART2EN;
    
    // Set alterative pin func
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE2, 0x2);   // PA2
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE3, 0x2);   // PA3

    // Enable alterative func
    BF_SET(GPIOA->AFRL, GPIOA_AFRL_AFSEL2, 0x4);    // PA2
    BF_SET(GPIOA->AFRL, GPIOA_AFRL_AFSEL3, 0x4);    // PA3

