Stachu1/STM32_Watch/firmware/main.c
    // Disable USART
    USART2->CR1 &= ~USART2_CR1_UE;

    // Set word len, Parity ctrl, 1 Stop bit, Enable TX
    USART2->CR1 &= ~(USART2_CR1_M0 | USART2_CR1_M1);
    USART2->CR1 &= ~USART2_CR1_PCE;
    BF_SET(USART2->CR2,USART2_CR2_STOP, 0x0);
    USART2->CR1 |= USART2_CR1_TE;

    // Set USART div (sysclk / baud_rate)
    USART2->BRR = (SYSCLK / BAUD) & 0xFFFF;         

    // Enable USART
    USART2->CR1 |= USART2_CR1_UE;
}

// Deinit UART
void UART_Deinit(void)
{
    // Disable UART
    USART2->CR1 &= ~USART2_CR1_UE;

    // Reset UART
    RCC->APB1RSTR |= RCC_APB1RSTR_USART2RST;
    RCC->APB1RSTR &= ~RCC_APB1RSTR_USART2RST;

    // Set PA2 and PA3 back to Analog Mode (0x3)
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE2, 0x3);
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE3, 0x3);

    // Clear AF selection
    BF_SET(GPIOA->AFRL, GPIOA_AFRL_AFSEL2, 0x0);
    BF_SET(GPIOA->AFRL, GPIOA_AFRL_AFSEL3, 0x0);

    // Disable clock
    RCC->APB1ENR &= ~RCC_APB1ENR_USART2EN;
}

// Sends char over UART
void Print_char(u8 c)
{
    while (!(USART2->ISR & USART2_ISR_TXE));
    BF_SET(USART2->TDR, USART2_TDR_TDR, c);
}

// Sends string over UART
void Print_str(c *str)
{
    while (*str)
    {
        Print_char(*(str++));
    }
}

// Sends u32 over UART
void Print_u32(u32 num)
{
    if (num == 0)
    {
        Print_char('0');
        return;
    }

    u8 digits[10];  
    u32 num_len = 0;

    while (num)
    {
        digits[num_len++] = '0' + (num % 10);
        num /= 10;
    }

    for (u32 i=num_len; i>0; i--)
    {
        Print_char(digits[i - 1]);
    }
}

// Sends i32 over UART
void Print_i32(i32 num)
{
    if (num == 0)
    {
        Print_char('0');
        return;
    }

    b32 is_neg = (num < 0) ? true : false;
    if (is_neg) num = -num;

    u8 digits[10];  
    u32 num_len = 0;

    while (num)
    {
        digits[num_len++] = '0' + (num % 10);
        num /= 10;
    }

    if (is_neg) Print_char('-');
    for (u32 i=num_len; i>0; i--)
    {
        Print_char(digits[i - 1]);
    }
}

// Sends q32 (q16.16) over UART
void Print_q32(q32 num)
{
    if (num == 0)
    {
        Print_str("0.0000");
        return;
    }

    if (num < 0)
    {
        Print_char('-');
        num = -num;
    }

    u32 int_part = (u32)(num >> FIXED_SHIFT);
    u32 frac_part = ((u32)(num & (FIXED_ONE - 1)) * 10000) >> FIXED_SHIFT;

    Print_u32(int_part);
    Print_char('.');

    // Print leading zeros for the fraction
    if (frac_part < 1000) Print_char('0');
    if (frac_part < 100)  Print_char('0');
    if (frac_part < 10)   Print_char('0');
    
    Print_u32(frac_part);
}

// Get Ambient light intensity
// May take a while in low light (~500ms)
u8 Ambient_Sense(void)
{
    u32 ambl = 0;
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE4, 0x1);   // PB4 as output
    GPIOB->BSRR |= GPIOB_BSRR_BS4;
    Delay_ms(1);
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE4, 0x0);   // PB4 as input
    while (GPIOB->IDR & GPIOB_IDR_ID4 && ambl != 2080768) ambl++;
    return (u8)(255 - (ambl >> 13));
}

// Init ADC for measuring battery voltage and core temperature
void ADC_Init(void)
{
    // Enable clock
    RCC->APB2ENR |= RCC_APB2ENR_ADCEN;

    // Disable ADC
    if (ADC->CR & ADC_CR_ADEN)
    {
        ADC->CR |= ADC_CR_ADDIS;
        while (ADC->CR & ADC_CR_ADEN);
    }

    // Calibration
    ADC->CR |= ADC_CR_ADCAL;
    while (ADC->CR & ADC_CR_ADCAL);

    // Config ADC
    ADC->CFGR1 |= ADC_CFGR1_DISCEN;
    ADC->CFGR1 &= ~ADC_CFGR1_CONT;
    ADC->CCR |= (ADC_CCR_TSEN | ADC_CCR_VREFEN);
    ADC->SMPR |= ADC_SMPR_SMPR_WIDTH;

    // Configure Oversampling x256 & 8 bit shift
    ADC->CFGR2 |= ADC_CFGR2_OVSE;
    BF_SET(ADC->CFGR2, ADC_CFGR2_OVSR, 0x7);
    BF_SET(ADC->CFGR2, ADC_CFGR2_OVSS, 0x8);

    // Enable ADC
    ADC->ISR |= ADC_ISR_ADRDY;
    ADC->CR |= ADC_CR_ADEN;
    while (!(ADC->ISR & ADC_ISR_ADRDY));
}

// Deinit ADC
void ADC_Deinit(void)
{
    // Stop ongoint conversions
    if (ADC->CR & ADC_CR_ADSTART)
    {
        ADC->CR |= ADC_CR_ADSTP;
        while (ADC->CR & ADC_CR_ADSTP);
    }

    // Disable ADC
    if (ADC->CR & ADC_CR_ADEN)
    {
        ADC->CR |= ADC_CR_ADDIS;
        while (ADC->CR & ADC_CR_ADEN);
    }

    // Disable voltage references
    ADC->CCR &= ~(ADC_CCR_TSEN | ADC_CCR_VREFEN);

    // Disable ADC voltage regulator
    ADC->CR |= ADC_CR_ADVREGEN;

    // Disable peripheral clock
    RCC->APB2ENR &= ~RCC_APB2ENR_ADCEN;
}

// Measures VDDA in mV
// (Needs ADC_Init)
u32 ADC_Get_VDDA(void)
{
    // Set Vref & Max conversion time
    ADC->CHSELR = ADC_CHSELR_CHSEL17;

    // Start ADC conversion, wait, read
    ADC->CR |= ADC_CR_ADSTART;
    while (!(ADC->ISR & ADC_ISR_EOC));
    u32 raw_vref = (u32)(ADC->DR & ADC_DR_DATA_MASK);
    u32 vdda_mV = (3000 * VREFINT_CAL) / raw_vref;
    return vdda_mV;
}

// Measures core temperature in m°C
// (Needs ADC_Init)
i32 ADC_Get_Temp(void)
{
    // Get VDDA
    u32 vdda_mV = ADC_Get_VDDA();

    // Set Tsen & Max conversion time
    ADC->CHSELR = ADC_CHSELR_CHSEL18;

    // Start ADC conversion, wait, read
    ADC->CR |= ADC_CR_ADSTART;
    while (!(ADC->ISR & ADC_ISR_EOC));
    u32 raw_tsen = (u32)(ADC->DR & ADC_DR_DATA_MASK);
    u32 tsen_cal =  raw_tsen * vdda_mV / 3000;

    // (TS_CAL2_TEMP - TS_CAL1_TEMP) / (rav_Tsen - TS_CAL1) + TS_CAL1_TEMP
    i32 core_temp = 100000 / (TS_CAL2 - TS_CAL1) * (tsen_cal - TS_CAL1) + 30000;
    return core_temp;
}

// Init I2C for the IMU
void I2C_Init(void)
{
    // Enable clock
    RCC->APB1ENR |= RCC_APB1ENR_I2C1EN;

    // Set alterative pin func
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE9, 0x2);   // PA9
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE10, 0x2);  // PA10

    // Set output open-drain
    GPIOA->OTYPER |= (GPIOA_OTYPER_OT9 | GPIOA_OTYPER_OT10);

    // Set high speed
    BF_SET(GPIOA->OSPEEDR, GPIOA_OSPEEDR_OSPEED9, 0x2);
    BF_SET(GPIOA->OSPEEDR, GPIOA_OSPEEDR_OSPEED10, 0x2);
    
    // Enable alterative func
    BF_SET(GPIOA->AFRH, GPIOA_AFRH_AFSEL9, 0x1);    // PA9
    BF_SET(GPIOA->AFRH, GPIOA_AFRH_AFSEL10, 0x1);   // PA10

    // Disable I2C
    I2C1->CR1 &= ~I2C1_CR1_PE;
    
    // Configure timing
    BF_SET(I2C1->TIMINGR, I2C1_TIMINGR_PRESC, 0x03);
    BF_SET(I2C1->TIMINGR, I2C1_TIMINGR_SCLL, 0x13);
    BF_SET(I2C1->TIMINGR, I2C1_TIMINGR_SCLH, 0x0F);
    BF_SET(I2C1->TIMINGR, I2C1_TIMINGR_SCLDEL, 0x04);
    BF_SET(I2C1->TIMINGR, I2C1_TIMINGR_SDADEL, 0x02);
    
    // Enable I2C
    I2C1->CR1 |= I2C1_CR1_PE;
}

