Stachu1/STM32_Watch/firmware/main.c
// Write data to a slave reg @ addr, reg over I2C
void I2C_Write(u8 addr, u8 reg, u8 *data, u8 size)
{
    // Wait until I2C is not busy
    while (I2C1->ISR & I2C1_ISR_BUSY);

    // Set address, number of bytes, and generate START
    I2C1->CR2 = (addr << 1);
    BF_SET(I2C1->CR2, I2C1_CR2_NBYTES, size + 1);
    I2C1->CR2 |= I2C1_CR2_START | I2C1_CR2_AUTOEND;

    // Select the reg
    while (!(I2C1->ISR & I2C1_ISR_TXIS));
    I2C1->TXDR = reg;

    // Transmit the data
    for (u32 i = 0; i < size; i++)
    {
        while (!(I2C1->ISR & I2C1_ISR_TXIS));
        I2C1->TXDR = data[i];
    }

    // Wait for stop flag (set by AUTOEND)
    while (!(I2C1->ISR & I2C1_ISR_STOPF));

    // Clear stop flag
    I2C1->ICR |= I2C1_ICR_STOPCF;            
}

// Read data from a slave reg @ addr, reg over I2C
void I2C_Read(u8 addr, u8 reg, u8 *buff, u8 size)
{
    // Wait until I2C is not busy
    while (I2C1->ISR & I2C1_ISR_BUSY);

    I2C1->CR2 = (addr << 1) | (1 << 16); // NBYTES = 1
    I2C1->CR2 |= I2C1_CR2_START; 
    
    while (!(I2C1->ISR & I2C1_ISR_TXIS));
    I2C1->TXDR = reg;
    while (!(I2C1->ISR & I2C1_ISR_TC));

    // Restart and Read
    I2C1->CR2 = (addr << 1) | I2C1_CR2_RD_WRN | (size << 16) | I2C1_CR2_START | I2C1_CR2_AUTOEND;
    
    for (int i = 0; i < size; i++)
    {
        while (!(I2C1->ISR & I2C1_ISR_RXNE));
        buff[i] = I2C1->RXDR;
    }

    while (!(I2C1->ISR & I2C1_ISR_STOPF));
    I2C1->ICR |= I2C1_ICR_STOPCF;
}

// Init the LSM6DSM IMU
void IMU_Init(void)
{
    // Set Accel to 208Hz, +/- 4g
    // CTRL1_XL register (ODR_XL) (FS_XL)
    u8 buf = (0x5 << 4) | (0x2 << 2);
    I2C_Write(IMU_ADDR, 0x10, &buf, 1);
}

// Read acceleration from the IMU
void IMU_Get_Accel(i16 *x, i16 *y, i16 *z)
{
    u8 buff[6];
    I2C_Read(IMU_ADDR, 0x28, buff, 6);
    *x = (i16)((buff[1] << 8) | buff[0]);
    *y = (i16)((buff[3] << 8) | buff[2]);
    *z = (i16)((buff[5] << 8) | buff[4]);
}

// Read temperature from the IMU in m°C
i32 IMU_Get_Temp(void)
{
    u8 buff[2];
    I2C_Read(IMU_ADDR, 0x20, buff, 2);

    // Convert raw value to m°C
    // 256 LSB/°C val=0 @25°C =>  m°C = °C*1000 + ((°C/256) * 39 + 5) / 10 + 25000
    return (i32)buff[1] * 1000 + (buff[0] * 39 + 5) / 10 + 25000;
}


// Init RTC for hand updates every second
void RTC_Init(void)
{
    // Disable backup domain write protection
    PWR->CR |= PWR_CR_DBP;

    // Start LSE and wait until ready
    if (!(RCC->CSR & RCC_CSR_LSERDY))
    {
        RCC->CSR |= RCC_CSR_LSEON;
        while (!(RCC->CSR & RCC_CSR_LSERDY));
    }

    // Set LSE as RTC clock source
    BF_SET(RCC->CSR, RCC_CSR_RTCSEL, 0x1);

    // Enable RTC
    RCC->CSR |= RCC_CSR_RTCEN;
}

// Set RTC time (12h format, hours max 12)
void RTC_Set_Time(u8 hours, u8 minutes, u8 seconds)
{
    // Wait for RTC to be ready
    RTC->ISR &= ~RTC_ISR_RSF;
    while (!(RTC->ISR & RTC_ISR_RSF)) Spin(10);

    // Disable write protection
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    // Enter initialization mode
    RTC->ISR |= RTC_ISR_INIT;
    while (!(RTC->ISR & RTC_ISR_INITF)) Spin(10);

    // Set RTC prescaler for 1Hz time base (LSE is 32.768 kHz)
    BF_SET(RTC->PRER, RTC_PRER_PREDIV_A, 0x7F);
    BF_SET(RTC->PRER, RTC_PRER_PREDIV_S, 0xFF);

    // Set 12h format
    RTC->CR |= RTC_CR_FMT;

    // Set time in BCD format
    u32 temp_tr = 0;
    temp_tr |= ((hours / 10) << RTC_TR_HT_LSB) | ((hours % 10) << RTC_TR_HU_LSB);
    temp_tr |= ((minutes / 10) << RTC_TR_MNT_LSB) | ((minutes % 10) << RTC_TR_MNU_LSB);
    temp_tr |= ((seconds / 10) << RTC_TR_ST_LSB) | (seconds % 10);
    RTC->TR = temp_tr;

    // Exit initialization mode
    RTC->ISR &= ~RTC_ISR_INIT;

    // Wait for synchronization
    RTC->ISR &= ~RTC_ISR_RSF; 
    while (!(RTC->ISR & RTC_ISR_RSF)) Spin(10);

    // Enable write protection
    RTC->WPR = 0xFF;
}

// Get RTC time
void RTC_Get_Time(u8 *hours, u8 *minutes, u8 *seconds)
{
    // Wait for RTC to be ready
    RTC->ISR &= ~RTC_ISR_RSF;
    while (!(RTC->ISR & RTC_ISR_RSF)) Spin(10);

    // Read time
    u32 tr = RTC->TR;
    *hours = ((tr & RTC_TR_HT_MASK) >> RTC_TR_HT_LSB) * 10 + ((tr & RTC_TR_HU_MASK) >> RTC_TR_HU_LSB);
    *minutes = ((tr & RTC_TR_MNT_MASK) >> RTC_TR_MNT_LSB) * 10 + ((tr & RTC_TR_MNU_MASK) >> RTC_TR_MNU_LSB);
    *seconds = ((tr & RTC_TR_ST_MASK) >> RTC_TR_ST_LSB) * 10 + ((tr & RTC_TR_SU_MASK) >> RTC_TR_SU_LSB);
}

// Enable RTC 0.2Hz interrupt for hand updates
void RTC_Wakeup_Init(void)
{
    // Wait for RTC to be ready
    RTC->ISR &= ~RTC_ISR_RSF;
    while (!(RTC->ISR & RTC_ISR_RSF)) Spin(10);

    // Disable Write Protection
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    // Disable Wakeup Timer to configure it
    RTC->CR &= ~RTC_CR_WUTE;

    // Wait for access allowed
    while (!(RTC->ISR & RTC_ISR_WUTWF)) Spin(10);

    // Configure Clock Source for 1Hz
    // WUCKSEL = 0b100 selects the 1Hz clock (RTCCLK div by prescalers)
    RTC->CR &= ~(RTC_CR_WUCKSEL_MASK << RTC_CR_WUCKSEL_LSB);
    RTC->CR |= (0x4 << RTC_CR_WUCKSEL_LSB);

    // Clear Wakeup Timer flag and EXTI pending bit
    RTC->ISR &= ~RTC_ISR_WUTF;
    EXTI->PR = EXTI_PR_PIF20;

    // For 0.2Hz clock, WUTR = 4 means 5 second interval (Interval = WUTR + 1)
    RTC->WUTR = 4;

    // Enable Interrupt and Timer
    RTC->CR |= RTC_CR_WUTIE | RTC_CR_WUTE;

    // Enable Write Protection
    RTC->WPR = 0xFF;

    // RTC Wakeup is connected to EXTI Line 20
    EXTI->IMR |= (1 << 20);    // Interrupt Mask: Enable line 20
    EXTI->RTSR |= (1 << 20);   // Rising Trigger: Enable

    // Enable RTC global interrupt in NVIC
    NVIC->ISER |= (1 << 2);
}

// Update hand new_values based on current RTC time
void RTC_Set_Hands(void)
{
    u8 h, m, s;
    RTC_Get_Time(&h, &m, &s);

    // Set hand new_values based on current time
    Hand_Set(0, h);
    Hand_Set(1, (m / 5 == 0) ? 12 : (m / 5));
    Hand_Set(2, (s / 5 == 0) ? 12 : (s / 5));
}

// Buttons GPIO and interrupt init
void BTN_Init(void)
{
    // Enable SYSCFG Clock
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;

    // Configure PB0 and PB1 as Input
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE0, 0x0);   // PB0 as input
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE1, 0x0);   // PB1 as input

    // Enable Internal Pull-Ups
    BF_SET(GPIOB->PUPDR, GPIOB_PUPDR_PUPD0, 0x1);
    BF_SET(GPIOB->PUPDR, GPIOB_PUPDR_PUPD1, 0x1);

    // Map PB0 and PB1 to EXTI Line 0 and 1
    SYSCFG_COMP->EXTICR1 &= ~(SYSCFG_COMP_EXTICR1_EXTI0_MASK | SYSCFG_COMP_EXTICR1_EXTI1_MASK);
    SYSCFG_COMP->EXTICR1 |= ((1 << SYSCFG_COMP_EXTICR1_EXTI0_LSB) | (1 << SYSCFG_COMP_EXTICR1_EXTI1_LSB));

    // Enable Rising and Falling Edge triggers
    EXTI->FTSR |= (EXTI_FTSR_FT0 | EXTI_FTSR_FT1); // Press
    EXTI->RTSR |= (EXTI_RTSR_RT0 | EXTI_RTSR_RT1); // Release
    EXTI->IMR  |= (EXTI_IMR_IM0 | EXTI_IMR_IM1);   // Unmask

    // Enable EXTI0_1 Interrupt (IRQ 5)
    NVIC->ISER |= (1 << 5);
}

