Stachu1/STM32_Watch/firmware/main.c
// Handle mode changes and mode-specific logic
void Mode_Handler(void)
{
    switch (current_mode)
    {
        case MODE_TIME:
            if (btn_up.pressed)
            {
                btn_up.pressed = false;
                Print_str("Changing brightness\n");
                brightness_level = (brightness_level == MAX_BRIGHTNESS_LEVEL) ? MIN_BRIGHTNESS_LEVEL : brightness_level + 1;
                RTC_Set_Hands();
            }
            if (btn_down.pressed)
            {
                btn_down.pressed = false;
                Print_str("Mode voltage\n");
                current_mode = MODE_VOLTAGE;
                Mode_Voltage_Handler(true);
            }
            break;
        case MODE_VOLTAGE:
            if (btn_up.pressed)
            {
                btn_up.pressed = false;
                Print_str("Mode temperature\n");
                current_mode = MODE_TEMPERATURE;
                Mode_Temperature_Handler(true);
            }
            if (btn_down.pressed)
            {
                btn_down.pressed = false;
                Print_str("Mode time setting entry\n");
                current_mode = MODE_TIME_SETTING;
                Mode_Time_Setting_Handler(true);
            }
            Mode_Voltage_Handler(false);
            break;
        case MODE_TEMPERATURE:
            if (btn_up.pressed)
            {
                btn_up.pressed = false;
                Print_str("Mode voltage\n");
                current_mode = MODE_VOLTAGE;
                Mode_Voltage_Handler(true);
            }
            if (btn_down.pressed)
            {
                btn_down.pressed = false;
                Print_str("Mode time setting entry\n");
                current_mode = MODE_TIME_SETTING;
                Mode_Time_Setting_Handler(true);
            }
            Mode_Temperature_Handler(false);
            break;
        case MODE_TIME_SETTING:
            Mode_Time_Setting_Handler(false);
            break;
        case MODE_PARTICLE_SIM:
            if (btn_up.pressed)
            {
                btn_up.pressed = false;
                Print_str("Changing brightness\n");
                brightness_level = (brightness_level == MAX_BRIGHTNESS_LEVEL) ? MIN_BRIGHTNESS_LEVEL : brightness_level + 1;
                Hand_Set(0, hands[0].value);
            }
            if (btn_down.pressed)
            {
                btn_down.pressed = false;
                Print_str("Mode time\n");
                current_mode = MODE_TIME;
                RTC_Set_Hands();
            }
            Mode_Particle_Sim_Handler(false);
            break;
    }
}

// Voltage mode: map battery voltage to hand position
void Mode_Voltage_Handler(b8 reset)
{
    static u32 last_update = 0;
    static u8 hand_idx = 0;

    if (reset)
    {
        last_update = 0;
        u32 vdda_mV = ADC_Get_VDDA();
        Print_str("Battery Voltage: ");
        Print_u32(vdda_mV);
        Print_str(" mV\n");

        // Map 2.0V-3.2V to 0-12 hand index (100mV per step)
        hand_idx = ((vdda_mV - 2000) / 100);
        if (hand_idx > 12) hand_idx = 12;
        Hand_Set(0, 1);
        Hand_Set(1, 0);
        Hand_Set(2, 0);
        return;
    }

    // Wait for hands value to be pulled from new_value
    if (hands[0].new_value != 255) last_update = millis;

    // Update hand values gradually for smooth animation
    if (hands[0].value < hand_idx && millis - last_update >= STATS_FRAME_TIME)
    {
        last_update = millis;
        Hand_Set(0, hands[0].value + 1);
    }
}

// Temperature mode: map IMU temperature to hand position
void Mode_Temperature_Handler(b8 reset)
{
    static u32 last_update = 0;
    static u8 hand_h_idx = 0;
    static u8 hand_m_idx = 0;

    if (reset)
    {
        last_update = 0;
        u32 temp_mC = IMU_Get_Temp();
        Print_str("IMU Temperature: ");
        Print_u32(temp_mC);
        Print_str(" mC\n");

        // Map 0°C-60°C to 0-12 hand_h index (5°C per step)
        // and 0.5°C per step for hand_m index
        hand_h_idx = temp_mC / 5000;
        hand_m_idx = (temp_mC - hand_h_idx * 5000) / 500;
        if (hand_h_idx > 12) hand_h_idx = 12;
        if (hand_m_idx > 12) hand_m_idx = 12;

        Hand_Set(0, 1);
        Hand_Set(1, 1);
        Hand_Set(2, 0);
        return;
    }

    // Wait for hands value to be pulled from new_value
    if (hands[0].new_value != 255) last_update = millis;

    // Update hand values gradually for smooth animation
    if ((hands[0].value < hand_h_idx || hands[1].value < hand_m_idx) && millis - last_update >= STATS_FRAME_TIME)
    {
        last_update = millis;
        if (hands[0].value < hand_h_idx)
        {
            Hand_Set(0, hands[0].value + 1);
        }
        if (hands[1].value < hand_m_idx)
        {
            Hand_Set(1, hands[1].value + 1);
        }
    }
}


void Mode_Time_Setting_Handler(b8 reset)
{
    static u32 last_update = 0;
    static enum {
        ENTRY,
        SET_HOURS,
        SET_MINUTES,
    } stage;
    static u8 h = 0, m = 0;

    if (reset)
    {
        // On entry, read RTC and round min down to nearest 5
        stage = ENTRY;
        Hand_Set(0, 0);
        Hand_Set(1, 0);
        Hand_Set(2, 0);
        return;
    }

    switch (stage)
    {
    case ENTRY:
        if (millis - last_update >= STATS_FRAME_TIME / 2)
        {
            last_update = millis;
            Hand_Set(0, (hands[0].value == 12) ? 1 : hands[0].value + 1);
        }
        if (btn_up.pressed)
        {
            btn_up.pressed = false;
            stage = SET_HOURS;
            Print_str("Setting Hours\n");
            h = 12;
            Hand_Set(0, h);
        }
        if (btn_down.pressed)
        {
            btn_down.pressed = false;
            current_mode = MODE_PARTICLE_SIM;
            Mode_Particle_Sim_Handler(true);
        }
        break;
    case SET_HOURS:
        if (btn_up.pressed)
        {
            btn_up.pressed = false;
            stage = SET_MINUTES;
            Print_str("Setting Minutes\n");
            Hand_Set(0, h);
            m = 60;
            Hand_Set(1, (m / 5 == 0) ? 12 : (m / 5));
        }
        if (btn_down.pressed)
        {
            btn_down.pressed = false;
            h = (h == 12) ? 1 : h + 1;
            Hand_Set(0, h);
        }
        break;
    case SET_MINUTES:
        if (btn_up.pressed)
        {
            btn_up.pressed = false;
            current_mode = MODE_TIME;
            RTC_Set_Time(h, m, 0);

            // Set hand new_values based on current time
            Hand_Set(0, h);
            Hand_Set(1, (m / 5 == 0) ? 12 : (m / 5));
            Hand_Set(2, 12);
            Print_str("Time Set\n");
        }
        if (btn_down.pressed)
        {
            btn_down.pressed = false;
            m = (m > 55) ? 5 : m + 5;
            Hand_Set(1, (m / 5 == 0) ? 12 : (m / 5));
        }
        break;
    }
}

