Stachu1/STM32_Watch/firmware/main.c
// Particle sim mode: display a simple particle simulation
void Mode_Particle_Sim_Handler(b8 reset)
{
    static u32 last_update = 0;
    static q32 alpha = 0;
    static q32 omega = 0;

    if (reset)
    {
        alpha = 0;
        omega = 0;
        Hand_Set(0, 0);
        Hand_Set(1, 0);
        Hand_Set(2, 0);
        return;
    }

    // Update simulation every 10ms for smooth animation
    if (millis - last_update >= PARTICLE_SIM_DT)
    {
        last_update = millis;

        // Get raw accel data from IMU
        i16 raw_x, raw_y, raw_z;
        IMU_Get_Accel(&raw_x, &raw_y, &raw_z);

        // Convert raw accel (+/- 4g) to q32
        q32 accel_x = (q32)raw_x << 3;
        q32 accel_y = (q32)raw_y << 3;

        // Scale down angle to fit 64 sin table
        u8 table_idx = (alpha >> (FIXED_SHIFT - 6))  & 63;
        q32 sin_v = SIN_LUT[table_idx];
        q32 cos_v = SIN_LUT[(table_idx + 16) & 63];

        // Rotate accel vector by alpha to align with hand and apply as acceleration to omega
        q32 accel_aligned = -(accel_x >> (FIXED_SHIFT / 2)) * (sin_v >> (FIXED_SHIFT / 2));
        accel_aligned -= (accel_y >> (FIXED_SHIFT / 2)) * (cos_v >> (FIXED_SHIFT / 2));

        // Integrate accel to get angular velocity
        // Multiply by dt and 1/(2*Pi*r) ~= 11
        // Divide by 1000 to convert ms to s
        omega += (accel_aligned * PARTICLE_SIM_DT * 11) >> 10;

        // Multiply by friction factor (0.98) to prevent runaway and add damping
        omega -= (omega * PARTICLE_FRICTION) >> FIXED_SHIFT;

        // Integrate omega to get angle
        // Multiply by dt and divide by 1000 to convert ms to s
        alpha += (omega * PARTICLE_SIM_DT) >> 10;

        // Add 1/12/2 for proper rounding
        u32 hand_pos = alpha + FIXED_ONE / 24;

        // Map to 0-255
        hand_pos = (hand_pos >> (FIXED_SHIFT - 8)) & 0xFF;

        // Mpa to 1-12 hand index (avoiding division)
        hand_pos = ((hand_pos * 3) >> 6);
        Hand_Set(0, (hand_pos == 0) ? 12 : hand_pos);
    }
}